import {useReducer} from 'react';
import {
    ADD_BOOK_ACTION,
    SAVE_BOOK_ACTION,
    REMOVE_BOOK_ACTION
} from "../actions/data-actions";

let lastBookId = 0;
let lastGenreId = 0;
const initialStage = {
    genres: {
        [++lastGenreId]: {
            name: 'Пригодницький',
            icon: 'https://cdn-icons-png.flaticon.com/128/2457/2457005.png'

        },
        [++lastGenreId]: {
            name: 'Романтика',
            icon: 'https://cdn-icons-png.flaticon.com/128/3884/3884935.png'

        },
        [++lastGenreId]: {
            name: 'Фентезі',
            icon: 'http://s1.iconbird.com/ico/2013/6/377/w128h1281372501695MagicWand4.png'

        }
    },
    books: {
        [++lastBookId]: {
            name: 'Тигролови',
            author: 'Іван Багряний',
            year: 1946,
            info: `Сюжетну канву роману побудовано навколо двох постатей — Григорія Многогрішного й майора НКВС Медвина. Їхній двобій — це боротьба Людини зі світом пітьми й пекла. Автор, як очевидець, змальовує страшні картини знущання над людьми, приниження їхньої людської гідності, насильства, приреченості на забуття в пеклі концтаборів.
            Юнак тікає з ешелону смерті — і в сотень інших арештантів піднімається дух, з'являється надія хоч не на порятунок, а на помсту своїм мучителям. Блукає в нетрях у пошуках порятунку й безпечного місця — і рятує дівчину-мисливця від розлюченої ведмедиці, хоча сам був на межі смерті від фізичного виснаження. Користується гостинністю українського роду Сірків із Зеленого Клину — і стає їм за сина та брата, партнера у полюванні. Закохується в Наталку, страждає, але приховує свої почуття, щоб не наражати дівчину на небезпеку, — і дає їй урешті-решт омріяне щастя взаємної любові.       
            `,
            genreIds: [1,2]

        },
        [++lastBookId]: {
            name: 'Мандрівний замок Хаула',
            author: 'Діана Вінн Джонс',
            year: 1986,
            info: 'Події книжки відбуваються у казковій країні Інгарії, де поряд зі звичайними людьми живуть чарівники і відьми. Час від часу на пагорбі зявляється високий чорнезний замок з чотирьох шпилястих веж, який, вважалося, належав Відьми Пустирищ. Головна героїня Софі — найстарша з трьох сестер, а народитися в цій країні найстаршою — неабияке безталання. Її мати померла, коли Софі було два роки, а її молодшій сестрі Летті — лише рік. Батько, власник крамнички дамських капелюшків у Маркет-Чиппінг, вдруге одружився зі своєю продавщицею Фанні, у них народилася донька Марта. Фанні дуже добре ставилася до всіх трьох дівчат і ніяким чином не виділяла Марту.     Більшість часу Софі проводить у крамничці й майструє капелюшки, наділяючи їх душею. Вона, як ніхто, вміє підібрати своїм покупцям саме той капелюшок. Одного дня до крамниці заходить Відьма Пустирищ і перетворює Софі на старезну бабусю, вважаючи, що вона якось повязана з чарівником Хаулом. Дівчина полишає своє містечко і долею випадку потрапляє в таємничий замок чарівника Хаула, де укладає угоду з вогняним демоном Кальцифером. На шляху до звільнення від закляття Софі доведеться розгадати багато загадок та побороти численні перешкоди.',
            genreIds: [1, 2, 3]
        },
        [++lastBookId]: {
            name: 'Гаррі Потер',
            author: 'Джоан Роулінг',
            year: 1997,
            info: 'Історія описує події у Школі Чарів і Чаклунства Гоґвортс, де його найкращими друзями є чарівники Рон Візлі і Герміона Ґрейнджер. Найцікавішою особистою прикметою Гаррі є шрам у вигляді блискавки на лобі, який зявився, коли Темний Лорд Волдеморт спробував вбити Гаррі ще малям, застосувавши закляття смерті Авада Кедавра. Волдеморт також, крім багатьох непокірних, вбив батьків Гаррі і зруйнував їхній будинок 31 жовтня 1981 року. Гаррі є знаменитим на увесь чаклунський світ через те, що він був єдиною особою, яка вижила після Авада Кедавра і цим спричинила крах Лорда Волдеморта.',
            genreIds: [1, 2, 3]
        }
    }

}
lastBookId++;
const addBook = (state, payload) => {
    const {books} = state;
    books[lastBookId] = payload.book;
    return {...state};

}

const saveBook = (state, payload) => {
    const {books} = state;
    books[payload.bookId] = payload.book;
    return {...state};
}

const removeBook = (state, payload) => {
    const {books} = state;
    const {bookId} = payload;
    delete books[bookId];
    return {...state};
}

const dataStorageReducer = (state, action) => {
    const {type, payload} = action;

    switch (type) {
        case ADD_BOOK_ACTION:
            return addBook(state, payload);
        case SAVE_BOOK_ACTION:
            return saveBook(state, payload);
        case REMOVE_BOOK_ACTION:
            return removeBook(state, payload);
        default:
            return state;
    }
}

const useDataStorage = () => useReducer(dataStorageReducer, initialStage);

export default useDataStorage;
